/*
 * Copyright 2013 Cheolmin Jo (webos21@gmail.com)
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef __NTDLL_H__
#define __NTDLL_H__

#include "nttypes.h"

//////////////////////////////////////////
// NTDLL MACRO
//////////////////////////////////////////

#define RTL_CLONE_PROCESS_FLAGS_CREATE_SUSPENDED 0x00000001
#define RTL_CLONE_PROCESS_FLAGS_INHERIT_HANDLES  0x00000002
#define RTL_CLONE_PROCESS_FLAGS_NO_SYNCHRONIZE   0x00000004 // don't update synchronization objects


//////////////
// AccessMask
//////////////
#define PROCESS_TERMINATE                  (0x0001)
#define PROCESS_CREATE_THREAD              (0x0002)
#define PROCESS_SET_SESSIONID              (0x0004)
#define PROCESS_VM_OPERATION               (0x0008)
#define PROCESS_VM_READ                    (0x0010)
#define PROCESS_VM_WRITE                   (0x0020)
#define PROCESS_DUP_HANDLE                 (0x0040)

#define SECTION_MAP_EXECUTE          0x0008
#define SECTION_EXTEND_SIZE          0x0010
#define SECTION_MAP_EXECUTE_EXPLICIT 0x0020 // not included in SECTION_ALL_ACCESS

#define SECTION_ALL_ACCESS (STANDARD_RIGHTS_REQUIRED|SECTION_QUERY|\
                            SECTION_MAP_WRITE |      \
                            SECTION_MAP_READ |       \
                            SECTION_MAP_EXECUTE |    \
                            SECTION_EXTEND_SIZE)
#endif // _WINNT_

#ifndef _WINBASE_
#define FILE_MAP_COPY       SECTION_QUERY
#define FILE_MAP_WRITE      SECTION_MAP_WRITE
#define FILE_MAP_READ       SECTION_MAP_READ
#define FILE_MAP_ALL_ACCESS SECTION_ALL_ACCESS
#define FILE_MAP_EXECUTE    SECTION_MAP_EXECUTE_EXPLICIT    // not included in FILE_MAP_ALL_ACCESS
#endif // _WINBASE_

#ifndef _WINNT_
#define PAGE_NOACCESS          0x01     
#define PAGE_READONLY          0x02     
#define PAGE_READWRITE         0x04     
#define PAGE_WRITECOPY         0x08     
#define PAGE_EXECUTE           0x10     
#define PAGE_EXECUTE_READ      0x20     
#define PAGE_EXECUTE_READWRITE 0x40     
#define PAGE_EXECUTE_WRITECOPY 0x80     
#define PAGE_GUARD            0x100     
#define PAGE_NOCACHE          0x200     
#define PAGE_WRITECOMBINE     0x400     
#define MEM_COMMIT           0x1000     
#define MEM_RESERVE          0x2000     
#define MEM_DECOMMIT         0x4000     
#define MEM_RELEASE          0x8000     
#define MEM_FREE            0x10000     
#define MEM_PRIVATE         0x20000     
#define MEM_MAPPED          0x40000     
#define MEM_RESET           0x80000     
#define MEM_TOP_DOWN       0x100000     
#define MEM_WRITE_WATCH    0x200000     
#define MEM_PHYSICAL       0x400000     
#define MEM_ROTATE         0x800000     
#define MEM_LARGE_PAGES  0x20000000     
#define MEM_4MB_PAGES    0x80000000     
#define SEC_FILE           0x800000     
#define SEC_IMAGE         0x1000000     
#define SEC_PROTECTED_IMAGE  0x2000000  
#define SEC_RESERVE       0x4000000     
#define SEC_COMMIT        0x8000000     
#define SEC_NOCACHE      0x10000000     
#define SEC_WRITECOMBINE 0x40000000     
#define SEC_LARGE_PAGES  0x80000000     
#define MEM_IMAGE         SEC_IMAGE     
#define WRITE_WATCH_FLAG_RESET 0x01     
#endif // _WINNT_


#define VM_LOCK_1		0x0001	// This is used, when calling KERNEL32.DLL VirtualLock routine
#define VM_LOCK_2		0x0002	// This require SE_LOCK_MEMORY_NAME privilege




//////////////////////////////////////////
// NTDLL Structures
//////////////////////////////////////////

// Pointer to a SECURITY_DESCRIPTOR  opaque data type.
typedef PVOID                 PSECURITY_DESCRIPTOR;

typedef RTL_CRITICAL_SECTION  CRITICAL_SECTION;  // winbase.h
typedef PRTL_CRITICAL_SECTION PCRITICAL_SECTION; // winbase.h

typedef ULONG_PTR             KAFFINITY;         // basetsd.h
typedef KAFFINITY            *PKAFFINITY;        // basetsd.h

typedef ULONG_PTR             KPRIORITY;

typedef struct _CLIENT_ID {
	/* These are numeric ids */
	HANDLE UniqueProcess;
	HANDLE UniqueThread;
} CLIENT_ID;
typedef CLIENT_ID *PCLIENT_ID;

typedef struct _SECTION_BASIC_INFORMATION {
  ULONG                     BaseAddress;
  ULONG                     SectionAttributes;
  LARGE_INTEGER             SectionSize;
} SECTION_BASIC_INFORMATION, *PSECTION_BASIC_INFORMATION;

typedef struct _SECTION_IMAGE_INFORMATION {
  PVOID                     TransferAddress;
  ULONG                     StackZeroBits;
  ULONG                     StackReserved;
  ULONG                     StackCommit;
  ULONG                     ImageSubsystem;
  union {
    struct {
      USHORT                SubSystemMinorVersion;
      USHORT                SubSystemMajorVersion;
    };
    ULONG                   SubSystemVersion;
  };
  ULONG                     GpValue;
  USHORT                    ImageCharacteristics;
  USHORT                    DllCharacteristics;
  USHORT                    Machine;
  BOOLEAN                   ImageContainsCode;
  union {
    UCHAR                   ImageFlags; 
	struct {
      UCHAR                 ComPlusNativeReady: 1;
      UCHAR                 ComPlusILOnly: 1;
      UCHAR                 ImageDynamicallyRelocated: 1;
      UCHAR                 ImageMappedFlat: 1;
      UCHAR                 BaseBelow4gb: 1;
      UCHAR                 Reserved: 3;
	  };
  };   
  ULONG                     LoaderFlags;
  ULONG                     ImageFileSize;
  ULONG                     CheckSum;
} SECTION_IMAGE_INFORMATION, *PSECTION_IMAGE_INFORMATION;

#ifndef _WINNT_
#define EXCEPTION_MAXIMUM_PARAMETERS   15
typedef struct _EXCEPTION_RECORD {
	DWORD                     ExceptionCode;
	DWORD                     ExceptionFlags;
	struct _EXCEPTION_RECORD *ExceptionRecord;
	PVOID                     ExceptionAddress;
	DWORD                     NumberParameters;
	ULONG_PTR                 ExceptionInformation[EXCEPTION_MAXIMUM_PARAMETERS];
} EXCEPTION_RECORD, *PEXCEPTION_RECORD;
#endif // _WINNT_

// DebugInfoClassMask
#define PDI_MODULES       0x01
#define PDI_BACKTRACE     0x02
#define PDI_HEAPS         0x04
#define PDI_HEAP_TAGS     0x08
#define PDI_HEAP_BLOCKS   0x10
#define PDI_LOCKS         0x20

typedef struct _DEBUG_BUFFER {
	HANDLE  SectionHandle;
	PVOID   SectionBase;
	PVOID   RemoteSectionBase;
	ULONG   SectionBaseDelta;
	HANDLE  EventPairHandle;
	ULONG   Unknown[2];
	HANDLE  RemoteThreadHandle;
	ULONG   InfoClassMask;
	ULONG   SizeOfInfo;
	ULONG   AllocatedSize;
	ULONG   SectionSize;
	PVOID   ModuleInformation;
	PVOID   BackTraceInformation;
	PVOID   HeapInformation;
	PVOID   LockInformation;
	PVOID   Reserved[8];
} DEBUG_BUFFER, *PDEBUG_BUFFER;

typedef struct _DEBUG_HEAP_INFORMATION {
	ULONG   Base;        // 0x00
	ULONG   Flags;       // 0x04
	USHORT  Granularity; // 0x08
	USHORT  Unknown;     // 0x0A
	ULONG   Allocated;   // 0x0C
	ULONG   Committed;   // 0x10
	ULONG   TagCount;    // 0x14
	ULONG   BlockCount;  // 0x18
	ULONG   Reserved[7]; // 0x1C
	PVOID   Tags;        // 0x38
	PVOID   Blocks;      // 0x3C Heap block pointer for this node.
} DEBUG_HEAP_INFORMATION, *PDEBUG_HEAP_INFORMATION; 

typedef struct _OBJECT_ATTRIBUTES {
	ULONG           Length;
	HANDLE          RootDirectory;
	PUNICODE_STRING ObjectName;
	ULONG           Attributes;
	PVOID           SecurityDescriptor;
	PVOID           SecurityQualityOfService;
}  OBJECT_ATTRIBUTES, *POBJECT_ATTRIBUTES;

typedef struct _PROCESS_BASIC_INFORMATION {
	NTSTATUS                  ExitStatus;
	PVOID                     PebBaseAddress; // PPEB_VISTA_7
	KAFFINITY                 AffinityMask;
	KPRIORITY                 BasePriority;
	ULONG_PTR                 UniqueProcessId;
	ULONG_PTR                 InheritedFromUniqueProcessId;
} PROCESS_BASIC_INFORMATION, *PPROCESS_BASIC_INFORMATION;

typedef enum _PROCESSINFOCLASS {
	ProcessBasicInformation = 0,
	ProcessDebugPort = 7,
	ProcessWow64Information = 26,
	ProcessImageFileName = 27,
	ProcessBreakOnTermination = 29
